# -*- coding: utf-8 -*-
"""Копия блокнота "analytics_HT_task.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Eu5sldbt1etwwbtfmht4gg-pY4LNJtDh

# Основы аналитики. Домашнее задание

В этом домашнем задании вы отработаете навыки, полученные в модуле, на реальных данных о населении в разных странах мира по годам.
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

df.head()

"""В следующих ячейках мы создаем объекты:

* `years` - список годов в данных

* `aruba_population` - население на Арубе по годам
"""

years = df.columns[1:].astype(int)

years[-5:]

aruba_population = df[df['Country Name'] == 'Aruba'].values[0][1:]

aruba_population[:5]

"""Построим график численности населения на Арубе по годам."""

plt.plot(years, aruba_population, '-')

"""## Задание 1

По аналогии с кодом выше нарисуйте график населения Болгарии.

Можно ли сказать, что население постоянно растет?
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')
years = df.columns[1:].astype(int)
aruba_population = df[df['Country Name'] == 'Bulgaria'].values[0][1:]
plt.plot(years, aruba_population, '-')

"""## Задание 2

Вычислите среднее значение населения Болгарии за все годы, представленные в таблице. Ответ округлите до целого числа.
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')
#aruba_population = df[df['Country Name'] == 'Aruba'].values[0][1:]

sum_god=df[df['Country Name'] == 'Bulgaria'].values[0][1:].sum()

d_size=len(df.columns)-1
res=sum_god/d_size
print(round(res))
'''
sum_god=df[df['Country Name'] == 'Bulgaria'].values[0][1:].mean()
print(round(sum_god))
'''

"""## Задание 3

Вычислите среднее значение населения Болгарии за пять последних лет, представленных в таблице. Верно ли, что в среднем за пять последних лет наблюдается прирост населения по сравнению со средним значением за все годы?
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

sum_god=df[df['Country Name'] == 'Bulgaria'].values[0][-5:].mean()
print(sum_god)

"""## Задание 4

Вычислите медиану населения Болгарии за все годы из таблицы. Ответ округлите до целого числа.
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

sum_god=df[df['Country Name'] == 'Bulgaria'].values[0][1:]
res=np.median(sum_god)
print(round(res))

"""## Задание 5

Найдите страну, население которой ведет себя похожим образом (как в Болгарии) - сначала растет, а потом падает. Что это за страна (из перечисленных)?

* Доминиканская республика
* Хорватия
* Эритрея
* Германия
* Косово
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

years = df.columns[1:].astype(int)
bulg_population = df[df['Country Name'] == 'Bulgaria'].values[0][1:]
plt.plot(years, bulg_population,label="bulg" '-')

dom_population = df[df['Country Name'] == 'Dominican Republic'].values[0][1:]
plt.plot(years, dom_population,label="dom" '-')

cro_population = df[df['Country Name'] == 'Croatia'].values[0][1:]
plt.plot(years, cro_population,label="cro" '-')

eri_population = df[df['Country Name'] == 'Eritrea'].values[0][1:]
plt.plot(years, eri_population,label="eri" '-')

ger_population = df[df['Country Name'] == 'Germany'].values[0][1:]
plt.plot(years, ger_population,label="ger" '-')

kos_population = df[df['Country Name'] == 'Kosovo'].values[0][1:]
plt.plot(years, kos_population,label="kos" '-')

plt.legend()
plt.show()

"""## Задание 6

В каком году в найденной в предыдущем задании стране был пик населения?
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')


cro_population = list(df[df['Country Name'] == 'Croatia'].values[0][1:])
maximum=max(cro_population)
a=cro_population.index(maximum)+1960
print(a)

"""## Задание 7

Вычислите корреляцию Пирсона между населением Болгарии и страны, найденной в задании 5. Ответ округлите до сотых.
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

cro_population = list(df[df['Country Name'] == 'Croatia'].values[0][1:])
bul_population = list(df[df['Country Name'] == 'Bulgaria'].values[0][1:])

a= np.corrcoef(cro_population,bul_population)[0,1]
print(round(a,2))

"""## Задание 8

Вычислите несмещенное выборочное стандартное отклонение для населения страны, найденной в задании 5. Ответ округлите до целого числа.
"""

import pandas as pd
import numpy as np
import statistics as st

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')

cro_population = list(df[df['Country Name'] == 'Croatia'].values[0][1:])

a=st.stdev(cro_population)
print(round(a))

"""## Задание 9

Вычислите несмещенное выборочное стандартное отклонение для населения Болгарии. Верно ли, что в Болгарии "разброс" относительно среднего количества населения больше, чем в стране, найденной в задании 5?
"""

import statistics as st

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')


cro_population = list(df[df['Country Name'] == 'Croatia'].values[0][1:])

bul_population = list(df[df['Country Name'] == 'Bulgaria'].values[0][1:])
a=st.stdev(cro_population)
b=st.stdev(bul_population)

print('Хорватия:',round(a))
print('Болгария:',round(b))

"""## Задание 10

Мы нашли две страны, в которых количество населения изменяется похожим образом. Попробуйте дать объяснение (исторические, социальные, экономические факторы) этому. Пишите ваш ответ в комментариях.
"""

Объяснение сходства в тенденциях изменения населения Хорватии и Болгарии можно найти в сочетании исторических, социальных и экономических факторов. Вот основные причины:

1. Исторические факторы:
   - Обе страны входили в состав бывших социалистических стран, что повлияло на их демографическую динамику, уровень рождаемости и миграционные процессы.
   - В постсоветский период обе страны столкнулись с экономическими трудностями, что повлияло на демографическую стабильность и рождаемость.

2. Экономические факторы:
   - Экономические кризисы и низкий уровень жизни привели к снижению рождаемости и увеличению эмиграции в обеих странах.
   - Высокий уровень безработицы и экономическая неопределенность стимулирует молодежь искать работу за границей, что вызывает сокращение населения.

3. Социальные факторы:
   - Уменьшение уровня рождаемости связано с общим европейским трендом.
   - Миграционные потоки связаны с поиском лучших условий жизни и работы за границей, особенно среди молодежи и квалифицированных специалистов.

4. Демографические процессы:
   - Старение населения: обе страны сталкиваются с увеличением доли пожилых людей, что влияет на общие показатели численности.
   - Низкий уровень рождаемости и эмиграция приводят к сокращению населения.

В целом, схожие исторические переживания, экономические трудности и социальные изменения способствовали тому, что динамика населения в Хорватии и Болгарии развивается по похожему сценарию.

"""## Задание 11 (бонус)

Есть ли в данных другие страны, население которых также похожим образом ведет себя на поведение численности населения в Болгарии? Среди этих стран есть ли та, корреляция населения которой с населением Болгарии больше найденной в задании 7?

Перечислите в комментариях найденные страны, а также укажите страну-лидер по корреляции с населением Болгарии.
"""

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

def koef(la, lb):
    koff= np.corrcoef(la,lb)[0,1]
    return koff

df = pd.read_csv("https://raw.githubusercontent.com/aiedu-courses/all_datasets/main/Population.csv", delimiter=';')
bul_population = list(df[df['Country Name'] == 'Bulgaria'].values[0][1:])
n=df.shape[0]
res=[]

for i in range (n):
    country=df.iloc[i][0]
    a=list(df[df['Country Name'] == country].values[0][1:])
    prom=koef(a,bul_population)
    if prom>0.8:
        res.append([df.loc[i][0], prom])

with open('D:\\study\\python\\азы аналитики\\output.txt','w') as ouf:
    for i in range(len(res)):
        a=" ".join(map(str, res[i]))
        ouf.write(a+ '\n')